In [ ]:
#Dictionary creation- dictionary datafrme ga creation

In [1]:
dict={'family_members':['durga rao','samba','siri','govardhan','sunil','raja','sasi','vastalya','kusuma','kundana']}
dict

{'family_members': ['durga rao',
  'samba',
  'siri',
  'govardhan',
  'sunil',
  'raja',
  'sasi',
  'vastalya',
  'kusuma',
  'kundana']}

In [5]:
import pandas
import pandas as pd
df=pd.DataFrame(dict)
df

  family_members
0      durga rao
1          samba
2           siri
3      govardhan
4          sunil
5           raja
6           sasi
7       vastalya
8         kusuma
9        kundana

In [6]:
dict1={'family_members':['durga rao','samba','siri','govardhan','sunil','raja','sasi','vastalya','kusuma','kundana'],'relation':['father','brother','daughter','son','husband','brother','neice','nephew','menakodalu','menakodalu1']}
dict1

{'family_members': ['durga rao',
  'samba',
  'siri',
  'govardhan',
  'sunil',
  'raja',
  'sasi',
  'vastalya',
  'kusuma',
  'kundana'],
 'relation': ['father',
  'brother',
  'daughter',
  'son',
  'husband',
  'brother',
  'neice',
  'nephew',
  'menakodalu',
  'menakodalu1']}

In [7]:
import pandas
import pandas as pd
df1=pd.DataFrame(dict1)
df1

  family_members     relation
0      durga rao       father
1          samba      brother
2           siri     daughter
3      govardhan          son
4          sunil      husband
5           raja      brother
6           sasi        neice
7       vastalya       nephew
8         kusuma   menakodalu
9        kundana  menakodalu1

In [8]:
dict3={"veg_items":['lemon rice','alu fry','brinjal curry','lady fingers fry'],'rating':[1,2,3,4]}
dict3

{'veg_items': ['lemon rice', 'alu fry', 'brinjal curry', 'lady fingers fry'],
 'rating': [1, 2, 3, 4]}

In [9]:
import pandas
import pandas as pd
df2=pd.DataFrame(dict3)
df2

          veg_items  rating
0        lemon rice       1
1           alu fry       2
2     brinjal curry       3
3  lady fingers fry       4

In [12]:
dict4={'nonveg_items':['chicken','mutton','fish','france','crab curry','egg biryani'],'rating':[1,2,3,4,5,6]}
dict4

{'nonveg_items': ['chicken',
  'mutton',
  'fish',
  'france',
  'crab curry',
  'egg biryani'],
 'rating': [1, 2, 3, 4, 5, 6]}

In [13]:
import pandas
import pandas as pd
df3=pd.DataFrame(dict4)
df3

  nonveg_items  rating
0      chicken       1
1       mutton       2
2         fish       3
3       france       4
4   crab curry       5
5  egg biryani       6

In [10]:
dict5={'city_names':['mtm','vja','hyd','guntur','chennai','kerala','kammam','varangal','tirupathi','kadapa'],'ratings':[1,2,3,4,5,6,7,8,9,10]}
dict5

{'city_names': ['mtm',
  'vja',
  'hyd',
  'guntur',
  'chennai',
  'kerala',
  'kammam',
  'varangal',
  'tirupathi',
  'kadapa'],
 'ratings': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]}

In [11]:
import pandas
import pandas as pd
df3=pd.DataFrame(dict5)
df3

  city_names  ratings
0        mtm        1
1        vja        2
2        hyd        3
3     guntur        4
4    chennai        5
5     kerala        6
6     kammam        7
7   varangal        8
8  tirupathi        9
9     kadapa       10